{
    "traps": {
        "AlarmModule": {
            "name": "Alarm Module",
            "description": "Two items for the price of one! A favorite of the paranoid and the rich, you can use this module to either add an alarm element to a trap you’re building, or it can be used as a ready-to-go trap for those who can’t be assed to sit down and make their own. When triggered, it will play a Very Loud song. And by Very Loud, I mean Norwegian Black Metal loud. You may program the song at a Sapper’s Table. If you do not or are unable to pick an alarm tone, a random, culturally-important song from the past US Billboard Hot 100 will be chosen.",
            "itemType": "Trap",
            "rarity": "Common",
            "effect": "When triggered, the Alarm Module emits a high-decibel alert, audible to all entities within a 1000-foot radius. Every creature in range gets an instant Awareness check. Failure means they will investigate, and you’ll have a warm welcome committee heading your way.",
            "duration": "Indefinite. Note: Once triggered, this trap is indestructible for the full duration of its alarm.",
            "triggerMechanism": "Varies",
            "range": "Touch",
            "vitalBonus": {},
            "skillBonus": {},
            "abilities": {},
            "hpBonus": 0,
            "mpBonus": 0
        },
        "SandmansNot-So-SubtleSnoozeBomb": {
            "name": "Sandman's Snooze Bomb",
            "description": "Ever wanted to make your foes take an unscheduled siesta without all that messy violence? Meet the Sandman's Not-So-Subtle Snooze Bomb! One whiff of this baby, and your enemies will be counting sheep faster than you can say 'narcolepsy'. Perfect for when you need a breather—or just want to watch them drool.",
            "itemType": "Trap",
            "rarity": "Uncommon",
            "effect": "When activated, releases a 30-foot radius cloud of sleep-inducing gas. Creatures within the area must make a Stamina saving throw or fall asleep for 1d6 minutes.",
            "duration": "Gas persists for 2 minutes before dissipating.",
            "triggerMechanism": "Pressure plate, tripwire, or proximity sensor.",
            "range": "30-foot radius",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "30 feet"
        },
        "TheClassicWhoopsieDaisyPitODoom": {
            "name": "Pit o' Doom Trap",
            "description": "Ah, the timeless joy of watching someone take that one misstep into oblivion. The 'Whoopsie Daisy' Pit o' Doom is your go-to for giving trespassers that sinking feeling. Spice it up with spikes if you're feeling particularly pointy—because what's a pit without a little peril?",
            "itemType": "Trap",
            "rarity": "Common",
            "effect": "When a creature steps on the hidden cover, it collapses, causing them to fall 20 feet. They take falling damage and may be trapped.",
            "duration": "Permanent until reset.",
            "triggerMechanism": "Weight-sensitive pressure.",
            "range": "Immediate area.",
            "damage": "2d6 (from fall)",
            "damageType": "Bludgeoning",
            "blastRadius": "N/A"
        },
        "GluemastersFancyFootwearFiasco": {
            "name": "Gluemaster's Trap",
            "description": "Tired of enemies running amok? Introduce them to the Gluemaster's Fancy Footwear Fiasco! This deviously sticky floor will have them stuck faster than a toddler in a taffy factory. Watch as they struggle, flail, and question their life choices—all while you sip your tea.",
            "itemType": "Trap",
            "rarity": "Common",
            "effect": "Creatures stepping onto the area become stuck and must succeed on a Strength check to free themselves.",
            "duration": "Adhesive remains effective for 1 hour.",
            "triggerMechanism": "Contact.",
            "range": "10x10 feet area.",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "N/A"
        },
        "NothingToSeeHereMirageWallOfMisfortune": {
            "name": "Mirage Wall Trap",
            "description": "Ever wanted to watch someone confidently walk into their own demise? The 'Nothing to See Here' Mirage Wall of Misfortune is your ticket to schadenfreude central. This seemingly solid wall is about as real as your New Year's resolutions, hiding all sorts of nasties behind it. Step right up—or through!",
            "itemType": "Trap",
            "rarity": "Rare",
            "effect": "Creatures attempting to interact with the wall pass through it, potentially falling into a pit or triggering another trap.",
            "duration": "Until dispelled.",
            "triggerMechanism": "Visual deception.",
            "range": "N/A",
            "damage": "Varies",
            "damageType": "Varies",
            "blastRadius": "N/A"
        },
        "WizardsSurpriseYoureSomewhereElseTeleportGlyph": {
            "name": "Wizard's 'Surprise, You're Somewhere Else!' Teleport Glyph",
            "description": "Feeling mischievous? The Wizard's 'Surprise, You're Somewhere Else!' Teleport Glyph is perfect for when you want your foes to take an unexpected field trip—preferably to somewhere less hospitable. Step on this bad boy, and poof! They're off to who-knows-where. Bon voyage!",
            "itemType": "Trap",
            "rarity": "Very Rare",
            "effect": "Instantly transports the triggering creature to a location set by the trap's creator.",
            "duration": "Permanent until deactivated.",
            "triggerMechanism": "Area entry.",
            "range": "Touch",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "N/A"
        },
        "ArcanophobesDelightNullificationZone": {
            "name": "Arcanophobe's Delight Nullification Zone",
            "description": "Got pesky spell-slingers ruining your day? Enter the Arcanophobe's Delight Nullification Zone! This nifty gadget creates a magic-free bubble where wizards become as useless as a bard in a strength contest. Watch as their spells fizzle and their confidence sags. Sweet, sweet silence.",
            "itemType": "Trap",
            "rarity": "Very Rare",
            "effect": "Creates a 20-foot radius anti-magic field, suppressing all magical effects and abilities.",
            "duration": "Lasts for 10 minutes once triggered.",
            "triggerMechanism": "Proximity detection.",
            "range": "20-foot radius",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "20 feet"
        },
        "FishermansCatchOfTheDaySurpriseNet": {
            "name": "Fisherman's 'Catch of the Day' Surprise Net",
            "description": "Cast your net wide—literally—with the Fisherman's 'Catch of the Day' Surprise Net! Perfect for ensnaring those who just can't mind their own business. Whether it's nosy adventurers or door-to-door potion salesmen, this trap ensures they stay put until you're ready to reel them in.",
            "itemType": "Trap",
            "rarity": "Common",
            "effect": "When triggered, a net springs up, restraining the creature until they break free with a Strength check.",
            "duration": "Until escaped or freed.",
            "triggerMechanism": "Pressure plate or tripwire.",
            "range": "Immediate area.",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "N/A"
        },
        "MadAlchemistsHazyDazeDisorientationSpray": {
            "name": "Mad Alchemist's Hazy Daze Disorientation Spray",
            "description": "Want to watch your enemies stumble around like they've had one too many at the tavern? The Mad Alchemist's Hazy Daze Disorientation Spray is your go-to solution! One puff, and they'll be questioning which way is up, down, and sideways. Hilarity ensues.",
            "itemType": "Trap",
            "rarity": "Uncommon",
            "effect": "Creatures in a 15-foot radius must make a Wit saving throw or become confused for 1 minute.",
            "duration": "Gas persists for 2 minutes.",
            "triggerMechanism": "Pressure plate or tripwire.",
            "range": "15-foot radius",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "15 feet"
        },
        "UpsideDownTownGravityFlipper": {
            "name": "Upside-Down Town Gravity Flipper",
            "description": "Why keep your enemies grounded when you can send them sky-high? The Upside-Down Town Gravity Flipper turns the world on its head—literally! Watch as trespassers defy physics and plummet upwards. Ceiling not included (but highly recommended).",
            "itemType": "Trap",
            "rarity": "Rare",
            "effect": "When activated, creatures in a 20-foot radius begin to fall upward, potentially hitting the ceiling and taking damage.",
            "duration": "Effect lasts for 1 minute.",
            "triggerMechanism": "Proximity sensor.",
            "range": "20-foot radius",
            "damage": "1d6 (from collision)",
            "damageType": "Bludgeoning",
            "blastRadius": "N/A"
        },
        "ChronomancersSlowYourRollTemporalBubble": {
            "name": "Chronomancer's 'Slow Your Roll' Temporal Bubble",
            "description": "Ever wish you could make your enemies move in slow motion while you sip your coffee? With the Chronomancer's 'Slow Your Roll' Temporal Bubble, you can! Step into this trap, and they'll feel like they're wading through molasses while you get things done at regular speed. Productivity for you, frustration for them.",
            "itemType": "Trap",
            "rarity": "Very Rare",
            "effect": "Creatures in a 15-foot radius have their speed halved and suffer a -2 penalty to AC and Dexterity saving throws.",
            "duration": "Effect lasts for 1 minute.",
            "triggerMechanism": "Area entry.",
            "range": "15-foot radius",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "15 feet"
        },
        "WitchsWickedWhammyRuneOfRegret": {
            "name": "Witch's Wicked Whammy Rune of Regret",
            "description": "Feeling a bit vindictive? The Witch's Wicked Whammy Rune of Regret is just the thing to ruin someone's day—or life. One step over this nasty little rune, and your victim will be cursing their luck (among other things) as they suffer misfortunes galore. Not for the faint of heart—or conscience.",
            "itemType": "Trap",
            "rarity": "Rare",
            "effect": "The creature must make a Wit saving throw or become cursed, suffering disadvantage on attack rolls.",
            "duration": "Until the curse is lifted.",
            "triggerMechanism": "Proximity or touch.",
            "range": "Touch",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "N/A"
        },
        "LiteraryBombshellsReadAndBoomSurprise": {
            "name": "Literary Bombshell's 'Read and Boom' Surprise",
            "description": "Books can be dangerous, but this takes it to a whole new level. The Literary Bombshell's 'Read and Boom' Surprise is a glyph that packs a punch—literally. Anyone curious enough to read or touch it gets an explosive lesson in minding their own business. Knowledge is power, but sometimes it's just a blast.",
            "itemType": "Trap",
            "rarity": "Uncommon",
            "effect": "Upon activation, explodes and deals 6d6 fire damage to creatures within 20 feet.",
            "duration": "One-time use.",
            "triggerMechanism": "Reading or touching the rune.",
            "range": "20-foot radius",
            "damage": "6d6",
            "damageType": "Fire",
            "blastRadius": "20 feet"
        },
        "LibrariansBlissfulBubbleOfShush": {
            "name": "Librarian's Blissful Bubble of Shush",
            "description": "Tired of noisy neighbors or chatty intruders? Step up your game with the Librarian's Blissful Bubble of Shush! This magical zone enforces the golden rule of silence, rendering even the loudest oaf as mute as a mime. Enjoy the sound of silence—and maybe some peace and quiet.",
            "itemType": "Trap",
            "rarity": "Uncommon",
            "effect": "Creates a 20-foot radius sphere where no sound can be created or heard.",
            "duration": "Lasts for 10 minutes.",
            "triggerMechanism": "Area entry.",
            "range": "20-foot radius",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "20 feet"
        },
        "FrostysFrigidFogMachine": {
            "name": "Frosty's Frigid Fog Machine",
            "description": "Bring a touch of winter to your enemies' doorstep with Frosty's Frigid Fog Machine! This trap releases a bone-chilling mist that slows down even the speediest of foes. Perfect for when you want them to 'chill out'—permanently.",
            "itemType": "Trap",
            "rarity": "Uncommon",
            "effect": "Creatures in a 15-foot radius take 1d6 cold damage and have their speed reduced by 10 feet.",
            "duration": "Mist persists for 1 minute.",
            "triggerMechanism": "Pressure plate or tripwire.",
            "range": "15-foot radius",
            "damage": "1d6",
            "damageType": "Cold",
            "blastRadius": "15 feet"
        },
        "DuplicatorsDelightWhosTheRealMeTrap": {
            "name": "Duplicator's Delight 'Who’s the Real Me?' Trap",
            "description": "Nothing says fun like an existential crisis! The Duplicator's Delight 'Who’s the Real Me?' Trap creates illusory copies of your bewildered victim, leading to mass confusion and maybe a few identity issues. Good luck figuring out who's who!",
            "itemType": "Trap",
            "rarity": "Rare",
            "effect": "Upon activation, several illusory duplicates appear, mimicking the creature's actions and causing confusion.",
            "duration": "Illusions last for 5 minutes.",
            "triggerMechanism": "Proximity detection.",
            "range": "Immediate area.",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "N/A"
        },
        "ShadowmancersLightsOutInstantNightfall": {
            "name": "Shadowmancer's 'Lights Out' Instant Nightfall",
            "description": "Flip the switch on your enemies with the Shadowmancer's 'Lights Out' Instant Nightfall! Plunge them into a darkness so deep, not even darkvision can help. It's like a blackout, but with more terror and stumbling.",
            "itemType": "Trap",
            "rarity": "Uncommon",
            "effect": "Creates a 15-foot radius sphere of darkness where even darkvision cannot penetrate.",
            "duration": "Lasts for 10 minutes.",
            "triggerMechanism": "Area entry.",
            "range": "15-foot radius",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "15 feet"
        },
        "CorrosionConnoisseursGearGrinder": {
            "name": "Corrosion Connoisseur's Gear Grinder",
            "description": "Want to see a grown warrior cry? Unleash the Corrosion Connoisseur's Gear Grinder! This trap releases a metal-munching mist that turns shiny armor into flaky rust faster than you can say 'disintegration.' Weapons, armor, dignity—it eats through it all!",
            "itemType": "Trap",
            "rarity": "Rare",
            "effect": "Metal items carried by creatures in a 10-foot radius begin to corrode, potentially destroying weapons and armor.",
            "duration": "One-time effect.",
            "triggerMechanism": "Pressure plate or proximity sensor.",
            "range": "10-foot radius",
            "damage": "None (item damage)",
            "damageType": "Corrosive",
            "blastRadius": "10 feet"
        },
        "SunburstSurpriseSeeSpotsFlashbang": {
            "name": "Sunburst Surprise 'See Spots' Flashbang",
            "description": "Add some sparkle to your defenses with the Sunburst Surprise 'See Spots' Flashbang! This trap unleashes a dazzling flash of light that leaves your foes blinking and blind. It's like a paparazzi ambush, but with more tactical advantage.",
            "itemType": "Trap",
            "rarity": "Uncommon",
            "effect": "Creatures within 20 feet must make a Stamina saving throw or be blinded for 1d4 rounds.",
            "duration": "Instantaneous effect.",
            "triggerMechanism": "Pressure plate or tripwire.",
            "range": "20-foot radius",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "20 feet"
        },
        "GreenThumbsGraspingGardenOfGotcha": {
            "name": "Green Thumb's Grasping Garden of Gotcha",
            "description": "Who says plants aren't aggressive? The Green Thumb's Grasping Garden of Gotcha unleashes vines that would make a jungle jealous. These tendrils wrap, trap, and make sure your uninvited guests are going nowhere fast. Mother Nature says hello!",
            "itemType": "Trap",
            "rarity": "Uncommon",
            "effect": "Vines erupt in a 15-foot radius, forcing creatures to make a Dexterity saving throw or become restrained.",
            "duration": "Vines wither after 5 minutes.",
            "triggerMechanism": "Pressure or proximity.",
            "range": "15-foot radius",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "15 feet"
        },
        "TeleportationTangoNowYouSeeMeNowYoureThereTrap": {
            "name": "Teleportation Tango 'Now You See Me, Now You're There' Trap",
            "description": "Ready to play a little game of 'musical chairs' with your enemies? The Teleportation Tango 'Now You See Me, Now You're There' Trap is the ultimate in spatial shenanigans. Whether you want to swap spots or send them packing to a predetermined locale, this trap keeps everyone on their toes—and possibly miles away.",
            "itemType": "Trap",
            "rarity": "Rare",
            "effect": "When activated, the trap either teleports the triggering creature to a predetermined location chosen during the trap's creation or swaps the creature's position with the creator. The effect can be toggled by the creator at the time of setting the trap.",
            "duration": "Until triggered or dispelled.",
            "triggerMechanism": "Proximity detection, area entry, or touch.",
            "range": "Teleportation up to 500 feet; swapping requires line of sight.",
            "damage": "None",
            "damageType": "None",
            "blastRadius": "N/A"
        }
    }
}
